#### BuiltInFailures.SkylightFailures Members

---

|  |
| --- |
| BuiltInFailures SkylightFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SkylightFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | MinSkylightWidthImperial | The minimum skylight width is 8 inches. |
| Public property Static member | MinSkylightWidthMetric | The minimum skylight width is 203.2 millimeters. |

# See Also

BuiltInFailures SkylightFailures Class

Autodesk.Revit.DB Namespace